In [5]:
import pandas as pd

from sqlalchemy import create_engine
engine = create_engine('postgresql://<<username:password>>@localhost:5432/sql_challenge_db')
connection = engine.connect()

In [13]:
salary_df = pd.read_sql("select * from \"salaries\"",connection)

pd.set_option('display.expand_frame_repr',False)

salary_df.head()

   emp_no   salary
0   10001  60117.0
1   10002  65828.0
2   10003  40006.0
3   10004  40054.0
4   10005  78228.0

In [19]:
employee_df = pd.read_sql("select * from \"employees\"",connection)

pd.set_option('display.expand_frame_repr',False)

employee_df.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date
0  473302     s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053     e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444     e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786     s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238     e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [ ]:
#rename emp_title to title_id

In [20]:
title_df = pd.read_sql("select * from \"titles\"",connection)

pd.set_option('display.expand_frame_repr',False)

title_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [ ]:
#merge salary and employee dfs on emp_no

In [ ]:
#merge employee and title dfs on title_id

In [4]:
connection.close()